RIET/src/Documents/ПроводкаDSS/ПроводкаDSS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроводкаDSS</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSS_SB</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSS_FA</registerRecords>
  <registerRecords>AccumulationRegister.НДСНачисленныйLawson</registerRecords>
  <registerRecords>AccumulationRegister.МатериальныеАктивы</registerRecords>
  <attributes>
    <name>System</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.InventoryСписание</types>
      <types>DocumentRef.ПроводкаDSS</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.InventoryПоступление</types>
      <types>DocumentRef.СчетКнигиПокупок</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.InventoryКорректировка</types>
      <types>DocumentRef.InventoryПеремещение</types>
      <types>DocumentRef.ОперацияLawson</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОплатаКнигиПокупок</types>
      <types>DocumentRef.ОтчетПринципалуОПродажах</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.НачислениеАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>GeoMarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>Модуль</name>
    <type>
      <types>EnumRef.МодулиРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FiscalType</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountLawson</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>BaseAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TranAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PeriodLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UpdateDateLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SeqTrnsNbrLawson</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OrigCompanyLawson</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Activity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JeTypeLawson</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JournalLawson</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LineNbrLawson</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AutoRevLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Operator</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LegalFiscalFlagLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorVname</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ApInvoice</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransNbr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OrigOperatorId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CashCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PoNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LineNbrIc</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PoCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AssetLawson</name>
    <type>
      <types>CatalogRef.ОсновныеСредстваLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ArInvoice</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentNbr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AktOfAcceptance</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AktDateLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ApTransFormId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентLawson</name>
    <type>
      <types>CatalogRef.КонтрагентыLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Deferred</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POLine</name>
    <type>
      <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>RubAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FiscAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TempDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PermDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExchDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроводки</name>
    <type>
      <types>EnumRef.ТипыПроводокAPAP</types>
    </type>
  </attributes>
  <attributes>
    <name>Ваучер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FiscalDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceLine</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </attributes>
  <attributes>
    <name>Urn</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/AccumulationRegisters/НДСНачисленныйLawson/НДСНачисленныйLawson.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДСНачисленныйLawson</name>
  <resources>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПроводкаDSS</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/InformationRegisters/НомераДокументовВПроводкахDSSИГТД/НомераДокументовВПроводкахDSSИГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераДокументовВПроводкахDSSИГТД</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/LawsonInvoice/LawsonInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LawsonInvoice</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ПроводкиDSS_SB</registerRecords>
  <attributes>
    <name>ArInvoice</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ОтчетАгентаПоРасходам</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.СчетКнигиПокупок</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетПринципалуОПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/Documents/ПроводкаDSS/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Реквизиты = Новый Структура;
	
	Для каждого Реквизит Из Метаданные.Документы.ПроводкаDSS.Реквизиты  Цикл  
		
		Реквизиты.Вставить(Реквизит.Имя, Ссылка[Реквизит.Имя]); 
		
	КонецЦикла;   
	
	Реквизиты.Вставить("Период", Дата);
	Реквизиты.Вставить("GltObjId", Номер); 
	Реквизиты.Вставить("Регистратор", Ссылка); 
	
	Если НЕ System = "MN" Тогда  
		
		Попытка 	
			
			Документы.ПроводкаDSS.ВыполнитьДвижениеПоРегиструПроводкиDSSОбщие(Реквизиты);	
			
			Если System = "BL" И СтрНайти(Description, "ACCRUAL") = 0
				// начало добавления, RG-Soft, Карасев В.В., 26.10.2016  вопрос ММВ-0000802
				ИЛИ (System = "AR" И SourceCode = "RM") Тогда
				// конец добавления, RG-Soft, Карасев В.В., 26.10.2016  вопрос ММВ-0000802
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ArInvoice", ArInvoice);
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	LawsonInvoice.Ссылка
				|ИЗ
				|	Документ.LawsonInvoice КАК LawsonInvoice
				|ГДЕ
				|	LawsonInvoice.ArInvoice = &ArInvoice"; 				  
				Результат = Запрос.Выполнить();   
				Выборка = Результат.Выбрать(); 
				Если Выборка.Следующий() Тогда
					LawsonInvoice = Выборка.Ссылка;
				Иначе
					LawsonInvoice = Документы.LawsonInvoice.ПустаяСсылка();
				КонецЕсли; 
				
				Документы.ПроводкаDSS.ВыполнитьДвижениеПоРегиструПроводкиDSSSB(Реквизиты,LawsonInvoice);	
				
			КонецЕсли;	
			
			Если System = "AM" Тогда
				
				Документы.ПроводкаDSS.ВыполнитьДвижениеПоРегиструПроводкиDSSFA(Реквизиты);
				
			КонецЕсли;   	
			
			//Временно закомментировано
			//Документы.ПроводкаDSS.ВыполнитьДвижениеПоРегиструПоРегиструМатериальныеАктивы(Реквизиты);
			
		Исключение
			
			Отказ = Истина;
			СтрокаОшибки = "Не удалось провести документ по регистрам: " + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("Ошибка при проведении DSS", УровеньЖурналаРегистрации.Ошибка, , , СтрокаОшибки);    
			
		КонецПопытки;   
		
	КонецЕсли; 
	// { RGS MYurkevich 19.02.2015 13:10:40 - 
	Если System = "BL" И AccountLawson = ПланыСчетов.Lawson.НайтиПоКоду("208601") 
		И Currency = Справочники.Валюты.НайтиПоНаименованию("USD") Тогда
		ЗаписьНДС = Движения.НДСНачисленныйLawson.ДобавитьПриход();
		ЗаписьНДС.Период = Дата;
		ЗаписьНДС.ПроводкаDSS = Ссылка;
		ЗаписьНДС.AU = AU;
		ЗаписьНДС.СуммаUSD = BaseAmount;
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			И НЕ Документ = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ПродажиВыручка_SBОбороты.СуммаНДСRURОборот, 0) КАК Сумма
			|ИЗ
			|	РегистрНакопления.ПродажиВыручка_SB.Обороты(, , , ДокументРеализации = &Документ) КАК ПродажиВыручка_SBОбороты";
			
			Запрос.УстановитьПараметр("Документ", Документ);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				Сумма = Выборка.Сумма;	
				Если Сумма <> 0 Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПроводкаDSS.Ссылка,
					|	ПроводкаDSS.BaseAmount КАК СуммаДокумента
					|ИЗ
					|	Документ.ПроводкаDSS КАК ПроводкаDSS
					|ГДЕ
					|	ПроводкаDSS.System = &System
					|	И ПроводкаDSS.AccountLawson = &AccountLawson
					|	И ПроводкаDSS.Currency = &Currency
					|	И ПроводкаDSS.Документ = &Документ
					|	И ПроводкаDSS.Ссылка <> &Ссылка";
					
					Запрос.УстановитьПараметр("AccountLawson", AccountLawson);
					Запрос.УстановитьПараметр("Currency", Currency);
					Запрос.УстановитьПараметр("System", System);
					Запрос.УстановитьПараметр("Документ", Документ);
					Запрос.УстановитьПараметр("Ссылка", Ссылка);
					РезультатЗапроса = Запрос.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					ТаблицаДокументов = Новый ТаблицаЗначений;
					ТаблицаДокументов.Колонки.Добавить("Ссылка");
					ТаблицаДокументов.Колонки.Добавить("СуммаДокумента");
					Пока Выборка.Следующий() Цикл
						НоваяСтрока = ТаблицаДокументов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					КонецЦикла;
					Если ТаблицаДокументов.Количество() <> 0 Тогда
						НоваяСтрока = ТаблицаДокументов.Добавить();
						НоваяСтрока.Ссылка = Ссылка;
						НоваяСтрока.СуммаДокумента = BaseAmount;
						СуммыПроводок = ТаблицаДокументов.ВыгрузитьКолонку("СуммаДокумента");
						МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Сумма, СуммыПроводок);
						Если МассивСумм <> Неопределено Тогда
							Инд = 0;
							Для Каждого Строка Из ТаблицаДокументов Цикл
								Если Строка.Ссылка = Ссылка Тогда
									ЗаписьНДС.СуммаРуб = МассивСумм[Инд];
								Иначе
									НаборЗаписей = РегистрыНакопления.НДСНачисленныйLawson.СоздатьНаборЗаписей();
									НаборЗаписей.Отбор.Регистратор.Установить(Строка.Ссылка);
									НаборЗаписей.Прочитать();
									Если НаборЗаписей.Количество() <> 0 Тогда
										НаборЗаписей[0].СуммаРуб = МассивСумм[Инд];
										НаборЗаписей.Записать();
									КонецЕсли; 
								КонецЕсли;
								Инд = Инд + 1;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;	
				Иначе 
					ЗаписьНДС.СуммаРуб = Сумма;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		Движения.НДСНачисленныйLawson.Записать();
	КонецЕсли;	
	// } RGS MYurkevich 19.02.2015 13:11:29 - 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;	
	
	// ++ КДС 02.02.2016 
	// для проводок системы RJ дозаполняем рублевую сумму по 500 счетам
	Если СокрЛП(System) = "RJ" И RubAmount = 0 и TranAmount <> 0 
		И Лев(AccountLawson.Код, 1) = "5"  Тогда
		Если Currency = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			RubAmount = TranAmount;
		Иначе
			RubAmount = BaseAmount * РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("999"), Дата).Курс;
		КонецЕсли;	
	КонецЕсли;
	// -- КДС 02.02.2016
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)    	
	
	//Движения по регистру сопоставлений номеров в проводках
	Если СокрЛП(System) = "BL" ИЛИ СокрЛП(System) = "AP" ИЛИ СокрЛП(System) = "AM" ИЛИ СокрЛП(System) = "IC" Тогда  
		
		Если ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый Тогда
			
			тPoNumber 	=  СокрЛП(PoNumber);
			тApInvoice 	=  СокрЛП(ApInvoice);
			тArInvoice 	=  СокрЛП(ArInvoice); 
			
			// т.к. проиндексировано только поле "Номер", а отбор нам нужен вплоть до "объект" (непроиндексировано), нам нужно накладывать полный отбор, иначе
			// будут конфликты тразакций
			
			Если СтрДлина(тPoNumber) > 7 Тогда
				ЗаписьPO = РегистрыСведений.НомераДокументовВПроводкахDSSИГТД.СоздатьМенеджерЗаписи();
				ЗаписьPO.Период 		= Дата;
				ЗаписьPO.Номер 			= тPoNumber;
				ЗаписьPO.ТипДокумента 	= "PO";
				ЗаписьPO.Объект 		= Ссылка;
				ЗаписьPO.Записать();    			
			КонецЕсли;
			
			Если СтрДлина(тApInvoice) > 7 Тогда
				ЗаписьAP = РегистрыСведений.НомераДокументовВПроводкахDSSИГТД.СоздатьМенеджерЗаписи();
				ЗаписьAP.Период 		= Дата;
				ЗаписьAP.Номер 			= тApInvoice;
				ЗаписьAP.ТипДокумента 	= "ApInv";
				ЗаписьAP.Объект 		= Ссылка;
				ЗаписьAP.Записать();
			ИначеЕсли СтрДлина(тArInvoice) > 7 Тогда
				ЗаписьAR = РегистрыСведений.НомераДокументовВПроводкахDSSИГТД.СоздатьМенеджерЗаписи();
				ЗаписьAR.Период 		= Дата;
				ЗаписьAR.Номер 			= тArInvoice;
				ЗаписьAR.ТипДокумента 	= "ArInv";
				ЗаписьAR.Объект 		= Ссылка;
				ЗаписьAR.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//<-
	
КонецПроцедуры
